
## Install the PostgreSQL driver psycopg2

In [1]:
#!pip install psycopg2

### Connect to PostgreSQL

In [3]:
import psycopg2

pgconn = psycopg2.connect(
    host="localhost",
    user="postgres",
    password="password")

In [4]:
pgcursor = pgconn.cursor()

### PostgreSQL is case senstive.  I use all lowercase to avoid using quotes...

In [4]:
#  https://stackoverflow.com/questions/34484066/create-a-postgres-database-using-python

from psycopg2.extensions import ISOLATION_LEVEL_AUTOCOMMIT # <-- ADD THIS LINE
pgconn.set_isolation_level(ISOLATION_LEVEL_AUTOCOMMIT) # <-- ADD THIS LINE

In [6]:
pgcursor.execute('DROP DATABASE IF EXISTS try')
pgcursor.execute('CREATE DATABASE try')

In [5]:
pgconn.close()

### We can connect directly to created Database.

In [34]:
import psycopg2

pgconn = psycopg2.connect(
    host="localhost", 
    database="try",#DB NAME
    user="postgres",#ADMIN
    password="password")#hide password

### Creating database from flat files

In [35]:
import pandas as pd
custdf = pd.read_csv("data/dimcustomer.csv", index_col = False)
custdf.head(2)

,CustomerKey,GeographyKey,CustomerAlternateKey,Title,FirstName,MiddleName,LastName,NameStyle,BirthDate,MaritalStatus,...,EnglishOccupation,SpanishOccupation,FrenchOccupation,HouseOwnerFlag,NumberCarsOwned,AddressLine1,AddressLine2,Phone,DateFirstPurchase,CommuteDistance
0,11000,26,AW00011000,NaN,Jon,V,Yang,0,1971-10-06,M,...,Professional,Profesional,Cadre,1,0,3761 N. 14th St,NaN,1 (11) 500 555-0162,2011-01-19,1-2 Miles
1,11001,37,AW00011001,NaN,Eugene,L,Huang,0,1976-05-10,S,...,Professional,Profesional,Cadre,0,1,2243 W St.,NaN,1 (11) 500 555-0110,2011-01-15,0-1 Miles

### To use pandas to_sql() method, we must use SQLAlchemy.

In [10]:
#!pip install sqlalchemy==1.3.0
#!conda install -c anaconda sqlalchemy

In [30]:
from sqlalchemy import create_engine


# connection string: driver://username:password@server/database
engine = create_engine('postgresql+psycopg2://postgres:password@localhost/try')
#CONNECT TO DRIVER postgresql+psycopg2:
#POSTGRES : USER ID
#pasword :PASSWORD
#localhost:server name
#try :db name

### Use the pandas to_sql() method to save the dataframe to a PostgreSQL table...

In [12]:
#  Note:  if_exists can be append, replace, fail.  
#custdf table will be inserted into customer table in DB
#engine DB connection,
#if_exists='replace' :remove all and add new comers
#if_exists='append':just append buttom of existing table

custdf.to_sql('customer', engine, if_exists='replace', index = False)

In [13]:
productdf = pd.read_csv("data/dimproduct.csv", index_col = False)
productdf.to_sql('product', engine, if_exists='replace', index = False)

In [14]:
datedf = pd.read_csv("data/dimdate.csv", index_col = False)
datedf.to_sql('dimdate', engine, if_exists='replace', index = False)

### Our transaction table is really large and cannot fit into a single dataframe.
### We can load in by chunks...

### Heavily inspired by this great blog by by Itamar Turner-Trauring....
https://pythonspeed.com/articles/indexing-pandas-sqlite/

to_sql() method docs: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_sql.html

In [15]:

for chunk in pd.read_csv("data/factinternetsales.csv", chunksize=1000):
    # Append all rows to a new database table, which we name 'sales':
    chunk.to_sql("sales", engine, if_exists="append")

In [16]:
pd.read_sql_query('select count(*) from sales', engine)

   count
0  60398

### Querying the database catalog, information_schema

In [18]:
pd.read_sql_query('''select ordinal_position, column_name, data_type  
                     from information_schema.columns 
                     where table_name = 'sales'
                ''', engine).head(2)

   ordinal_position column_name data_type
0                 1       index    bigint
1                 2  ProductKey    bigint

In [19]:
pgconn = engine.connect()

In [20]:
#Create index
pgconn.execute('CREATE INDEX IF NOT EXISTS idx_orderdate ON sales("OrderDate")')

In [31]:
pd.read_sql_query('''select ordinal_position, column_name, data_type  
                    from information_schema.columns 
                     where table_name = 'dimdate'
                  ''', engine).head(5)

   ordinal_position           column_name data_type
0                 1               DateKey    bigint
1                 2  FullDateAlternateKey      text
2                 3       DayNumberOfWeek    bigint
3                 4  EnglishDayNameOfWeek      text
4                 5  SpanishDayNameOfWeek      text

### Filtering leveraging an index...

In [23]:
pd.read_sql_query('''
                  select  d."CalendarYear", d."CalendarQuarter", sum("SalesAmount") 
                  from sales    s
                  join dimdate  d 
                  on (s."OrderDateKey" = d."DateKey")
                  where "OrderDate" BETWEEN '2011-01-01' and '2012-12-31'
                  group by d."CalendarYear", d."CalendarQuarter"
                  order by d."CalendarYear", d."CalendarQuarter"
                  ''', engine).round()

   CalendarYear  CalendarQuarter        sum
0          2011                1  1421357.0
1          2011                2  1801595.0
2          2011                3  1814388.0
3          2011                4  2038185.0
4          2012                1  1375841.0
5          2012                2  1314374.0
6          2012                3  1454653.0
7          2012                4  1654191.0

### Remember to leverage Python's features....

In [33]:
import pandas as pd

def get_columns(tablename):
    return pd.read_sql_query('''select ordinal_position, column_name, data_type  
                                from information_schema.columns 
                                where table_name = '{}'  
                             ''' .format(tablename)
                             ,engine)
get_columns('sales').head(5)

   ordinal_position   column_name data_type
0                 1         index    bigint
1                 2    ProductKey    bigint
2                 3  OrderDateKey    bigint
3                 4    DueDateKey    bigint
4                 5   ShipDateKey    bigint

In [27]:
pgconn.close()
engine.dispose()